Revit 2027 API
ParameterTypeId.RoomNumber Property
 "Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomNumber { get; }
Public Shared ReadOnly Property RoomNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomNumber {
	ForgeTypeId^ get ();
}
static member RoomNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace